results-petclinic-jvm/run_5_2026-01-05_01-30-28/FIXED-3000-latency-1-dump.txt
Running 30s test @ http://127.0.0.1:8006
  16 threads and 16 connections
  Thread calibration: mean lat.: 2817.440ms, rate sampling interval: 8159ms
  Thread calibration: mean lat.: 3001.448ms, rate sampling interval: 8204ms
  Thread calibration: mean lat.: 2627.914ms, rate sampling interval: 6995ms
  Thread calibration: mean lat.: 2745.996ms, rate sampling interval: 7540ms
  Thread calibration: mean lat.: 2723.668ms, rate sampling interval: 7368ms
  Thread calibration: mean lat.: 2785.573ms, rate sampling interval: 7258ms
  Thread calibration: mean lat.: 2755.855ms, rate sampling interval: 7712ms
  Thread calibration: mean lat.: 2680.740ms, rate sampling interval: 7245ms
  Thread calibration: mean lat.: 3099.528ms, rate sampling interval: 8675ms
  Thread calibration: mean lat.: 2777.845ms, rate sampling interval: 7380ms
  Thread calibration: mean lat.: 2883.521ms, rate sampling interval: 7860ms
  Thread calibration: mean lat.: 2722.257ms, rate sampling interval: 7385ms
  Thread calibration: mean lat.: 2625.708ms, rate sampling interval: 7122ms
  Thread calibration: mean lat.: 2788.853ms, rate sampling interval: 7155ms
  Thread calibration: mean lat.: 2708.077ms, rate sampling interval: 7516ms
  Thread calibration: mean lat.: 2814.670ms, rate sampling interval: 7766ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.53s   926.09ms   5.24s    71.96%
    Req/Sec   195.91     17.32   227.00     65.62%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.80s 
 75.000%    4.21s 
 90.000%    4.49s 
 99.000%    5.01s 
 99.900%    5.22s 
 99.990%    5.24s 
 99.999%    5.24s 
100.000%    5.24s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.751     0.000000            1         1.00
    2166.783     0.100000         6711         1.11
    2791.423     0.200000        13414         1.25
    3246.079     0.300000        20136         1.43
    3514.367     0.400000        26873         1.67
    3796.991     0.500000        33533         2.00
    3901.439     0.550000        36934         2.22
    3983.359     0.600000        40247         2.50
    4063.231     0.650000        43654         2.86
    4139.007     0.700000        46993         3.33
    4206.591     0.750000        50320         4.00
    4235.263     0.775000        51982         4.44
    4263.935     0.800000        53743         5.00
    4304.895     0.825000        55366         5.71
    4362.239     0.850000        57086         6.67
    4415.487     0.875000        58757         8.00
    4460.543     0.887500        59557         8.89
    4493.311     0.900000        60377        10.00
    4534.271     0.912500        61224        11.43
    4575.231     0.925000        62054        13.33
    4607.999     0.937500        62927        16.00
    4620.287     0.943750        63307        17.78
    4640.767     0.950000        63769        20.00
    4665.343     0.956250        64160        22.86
    4689.919     0.962500        64551        26.67
    4710.399     0.968750        64989        32.00
    4722.687     0.971875        65176        35.56
    4743.167     0.975000        65440        40.00
    4755.455     0.978125        65607        45.71
    4775.935     0.981250        65810        53.33
    4808.703     0.984375        66009        64.00
    4833.279     0.985938        66118        71.11
    4874.239     0.987500        66220        80.00
    4947.967     0.989062        66323        91.43
    5029.887     0.990625        66427       106.67
    5099.519     0.992188        66540       128.00
    5115.903     0.992969        66590       142.22
    5136.383     0.993750        66653       160.00
    5152.767     0.994531        66707       182.86
    5156.863     0.995313        66752       213.33
    5160.959     0.996094        66794       256.00
    5165.055     0.996484        66827       284.44
    5169.151     0.996875        66848       320.00
    5177.343     0.997266        66884       365.71
    5181.439     0.997656        66897       426.67
    5193.727     0.998047        66928       512.00
    5201.919     0.998242        66941       568.89
    5210.111     0.998437        66950       640.00
    5218.303     0.998633        66976       731.43
    5218.303     0.998828        66976       853.33
    5222.399     0.999023        67002      1024.00
    5222.399     0.999121        67002      1137.78
    5222.399     0.999219        67002      1280.00
    5226.495     0.999316        67030      1462.86
    5226.495     0.999414        67030      1706.67
    5226.495     0.999512        67030      2048.00
    5226.495     0.999561        67030      2275.56
    5226.495     0.999609        67030      2560.00
    5230.591     0.999658        67040      2925.71
    5230.591     0.999707        67040      3413.33
    5230.591     0.999756        67040      4096.00
    5230.591     0.999780        67040      4551.11
    5234.687     0.999805        67045      5120.00
    5234.687     0.999829        67045      5851.43
    5234.687     0.999854        67045      6826.67
    5238.783     0.999878        67050      8192.00
    5238.783     0.999890        67050      9102.22
    5238.783     0.999902        67050     10240.00
    5238.783     0.999915        67050     11702.86
    5238.783     0.999927        67050     13653.33
    5238.783     0.999939        67050     16384.00
    5242.879     0.999945        67054     18204.44
    5242.879     1.000000        67054          inf
#[Mean    =     3533.591, StdDeviation   =      926.094]
#[Max     =     5238.784, Total count    =        67054]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  85321 requests in 30.00s, 127.16MB read
Requests/sec:   2844.20
Transfer/sec:      4.24MB